app/controllers/video_controller.rb

  def gera_video
    require 'openssl'
    require 'digest/sha1'

    user_agent = request.env['HTTP_USER_AGENT']

    Rails.logger.info " request - #{request} "

    Rails.logger.info " User Agent - #{user_agent} "
    Rails.logger.info " Token Video - #{params[:tokenvideo]} "
    token_video = params[:tokenvideo]
    video = params[:video]

    iv = Base64.decode64("kT+uMuPwUk2LH4cFbK0GiA==")
    key = ["6476b3f5ec6dcaddb637e9c9654aa687"].pack("H*")

    decipher = OpenSSL::Cipher::Cipher.new('aes-128-cbc')
    decipher.decrypt
    decipher.key = key
    decipher.iv = iv

    Rails.logger.info "token_video: #{token_video}"
    if token_video == "" || token_video == nil || token_video == " "
      token_video = "YvfRfUIiy1XlbKET9HO1mFZmpXdq0iTn7pAX5oiuy+I="
    end
    text = decipher.update(Base64.strict_decode64(token_video))
    text << decipher.final
---
INSERT INTO `videos` (`created_at`, `path`, `status`, `token`, `updated_at`) VALUES ('2015-08-10 18:50:32', 'video/3000/1000', 0, 'rg_t_f17F5qymDe6tWSqvLn0YU0&e=1439233232', '2015-08-10 18:50:32')

  def exibe_video

    user_agent = request.env['HTTP_USER_AGENT']
    chrome, safari, firefox = false
    diretorio = "/mnt/Vids"

    Rails.logger.info "UserAgente - #{user_agent}"
    if user_agent =~ /Chrome/
      chrome = true
      Rails.logger.info "Browser Chrome"
    end
    if user_agent =~ /QuickTime/
      safari = true
      Rails.logger.info "Browser QuickTime"
    end
    if user_agent =~ /Firefox/
      firefox = true
      Rails.logger.info "Browser Firefox"
    end

    file_name = params[:caminho2] + ".mp4"
    if file_name == "4125945F1D0BE26B4474C897026704D1B88E621082015073455" || file_name == "41259E2B5E7A778474B62AA8464709CBA962B20082015120530" || file_name == "412595829D51A8AC549F8B3FB7E67C41238F217082015163546"
      diretorio = "/opt/railsapps/videos"
    end
    file_path = File.join([diretorio, params[:caminho1], params[:caminho2] + ".mp4"])


    Rails.logger.info "Iniciando a consulta no exibe video com os parametros - #{params}"

    token = params[:token] + "&e=" + params[:e]
    video = Video.find_by_token(token)
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`token` = 'rg_t_f17F5qymDe6tWSqvLn0YU0&e=1439233232' LIMIT 1

        video.status = true
        video.time = Time.now
      #  video.range = range
        video.save
---
UPDATE `videos` SET `status` = 1, `updated_at` = '2015-08-10 22:09:46' WHERE `videos`.`id` = 532